In [23]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

# set seed for reproducibility
np.random.seed(0) 


train = pd.read_csv('data/customer_churn_dataset-training-master.csv')
train.columns = [c.replace(" ","") for c in train.columns] 

test = pd.read_csv('data/customer_churn_dataset-testing-master.csv')
test.columns = [c.replace(" ","") for c in test.columns] 

#['id', 'age', 'gender', 'tenure', 'frequency', 'calls', 'delay', 'subscription', 'contractlength', 'spend', 'lastinteraction', 'churn']
train.dtypes, test.dtypes

(CustomerID          float64
 Age                 float64
 Gender               object
 Tenure              float64
 UsageFrequency      float64
 SupportCalls        float64
 PaymentDelay        float64
 SubscriptionType     object
 ContractLength       object
 TotalSpend          float64
 LastInteraction     float64
 Churn               float64
 dtype: object,
 CustomerID           int64
 Age                 object
 Gender              object
 Tenure               int64
 UsageFrequency       int64
 SupportCalls        object
 PaymentDelay         int64
 SubscriptionType    object
 ContractLength      object
 TotalSpend           int64
 LastInteraction      int64
 Churn                int64
 dtype: object)

In [24]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440833 entries, 0 to 440832
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   CustomerID        440832 non-null  float64
 1   Age               440832 non-null  float64
 2   Gender            440832 non-null  object
 3   Tenure            440832 non-null  float64
 4   UsageFrequency    440832 non-null  float64
 5   SupportCalls      440832 non-null  float64
 6   PaymentDelay      440832 non-null  float64
 7   SubscriptionType  440832 non-null  object
 8   ContractLength    440832 non-null  object
 9   TotalSpend        440832 non-null  float64
 10  LastInteraction   440832 non-null  float64
 11  Churn             440832 non-null  float64
dtypes: float64(9), object(3)
memory usage: 40.4+ MB

In [25]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64374 entries, 0 to 64373
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   CustomerID        64374 non-null  int64
 1   Age               64368 non-null  object
 2   Gender            64374 non-null  object
 3   Tenure            64374 non-null  int64
 4   UsageFrequency    64374 non-null  int64
 5   SupportCalls      64368 non-null  object
 6   PaymentDelay      64374 non-null  int64
 7   SubscriptionType  64371 non-null  object
 8   ContractLength    64374 non-null  object
 9   TotalSpend        64374 non-null  int64
 10  LastInteraction   64374 non-null  int64
 11  Churn             64374 non-null  int64
dtypes: int64(7), object(5)
memory usage: 5.9+ MB

In [15]:
df[df.isna().any(axis=1)]

,id,age,gender,tenure,frequency,calls,delay,subscription,contractlength,spend,lastinteraction,churn
199295,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
# get the number of missing data points per column
missing_values_count = df.isnull().sum()

In [9]:
missing_values_count

id                 0
age                6
gender             0
tenure             0
frequency          0
calls              6
delay              0
subscription       3
contractlength     0
spend              0
lastinteraction    0
churn              0
dtype: int64

In [10]:
df[df.age.isnull()]

,id,age,gender,tenure,frequency,calls,delay,subscription,contractlength,spend,lastinteraction,churn
71,72,NaN,Female,34,20,1,1,Basic,Annual,986,19,0
104,105,NaN,Male,10,22,9,0,Standard,Quarterly,218,7,0
385,386,NaN,Female,41,15,10,27,Premium,Quarterly,814,19,1
432,433,NaN,Female,9,19,4,26,Basic,Annual,805,21,0
491,492,NaN,Female,44,30,2,30,Standard,Annual,844,23,0
536,537,NaN,Female,4,15,7,13,Premium,Quarterly,344,23,0

In [3]:
non_numberic_ages = df.age.str.contains('[^0-9.-]')
# df.loc[non_numberic_ages].head()
set(df.age[non_numberic_ages])

0        False
1        False
2        False
3        False
4        False
         ...
64369    False
64370    False
64371    False
64372    False
64373    False
Name: age, Length: 64374, dtype: object